sorosaulong-ux/gd32-test-project/Library/gd32a7xx_fmu.h
/*!
    \file    gd32a7xx_fmu.h
    \brief   definitions for the FMU

    \version 2025-08-06, V0.1.0, firmware for GD32A7xx
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef GD32A7XX_FMU_H
#define GD32A7XX_FMU_H

#include "gd32a7xx.h"

/* FMU definitions */
#define FMU                                      FMU_BASE + 0x00000000U                                    /*!< FMU base address */
#define FMU_FGTSEN_BASE                          FMU_BASE + 0x00000140U                                    /*!< FMU fault group trigger source enable register base address */
#define FMU_FGTSSTAT_BASE                        FMU_BASE + 0x00000160U                                    /*!< FMU fault group trigger source status register base address */
#define FMU_FGSWTEN_BASE                         FMU_BASE + 0x00000180U                                    /*!< FMU fault group software triggered fault enable register base address */

/* registers definitions */
#define FMU_CTL                                  REG32((FMU) + 0x00000000U)                                /*!< FMU control register */
#define FMU_CTLKEY                               REG32((FMU) + 0x00000004U)                                /*!< FMU control key register */
#define FMU_CFG                                  REG32((FMU) + 0x00000008U)                                /*!< FMU configuration register */
#define FMU_FGCFG                                REG32((FMU) + 0x0000001CU)                                /*!< FMU fault group configuration register */
#define FMU_FGSUBSRCFG                           REG32((FMU) + 0x0000004CU)                                /*!< FMU fault group subsystem reset configuration register */
#define FMU_FGSTAT                               REG32((FMU) + 0x00000080U)                                /*!< FMU fault group status register */
#define FMU_FGKEY                                REG32((FMU) + 0x00000090U)                                /*!< FMU fault group key register */
#define FMU_FGEN                                 REG32((FMU) + 0x00000094U)                                /*!< FMU fault group enable register  */
#define FMU_FGCMTEN                              REG32((FMU) + 0x000000A4U)                                /*!< FMU fault group CAUTION work mode timeout enable register */
#define FMU_FGCMTVAL                             REG32((FMU) + 0x000000B4U)                                /*!< FMU fault group CAUTION work mode timeout value register */
#define FMU_IMTVAL                               REG32((FMU) + 0x000000B8U)                                /*!< FMU INIT work mode timeout value register */
#define FMU_FPCTL                                REG32((FMU) + 0x000000BCU)                                /*!< FMU fault pin control */
#define FMU_STAT                                 REG32((FMU) + 0x000000C0U)                                /*!< FMU status register */
#define FMU_NTCHSTAT                             REG32((FMU) + 0x000000C4U)                                /*!< FMU NORMAL transform to CAUTION work mode hold status register */
#define FMU_CTFHSTAT                             REG32((FMU) + 0x000000C8U)                                /*!< FMU CAUTION transform to FAULT work mode hold status register */
#define FMU_NTFHSTAT                             REG32((FMU) + 0x000000CCU)                                /*!< NORMAL transform to FAULT work mode hold status register */
#define FMU_FTCHSTAT                             REG32((FMU) + 0x000000D0U)                                /*!< FMU FAULT transform to CAUTION work mode hold status register */
#define FMU_FFGNCFG                              REG32((FMU) + 0x000000DCU)                                /*!< FMU fake fault group fault number configuration register  */
#define FMU_INTRPD                               REG32((FMU) + 0x000000E0U)                                /*!< FMU interrupt request pending register */
#define FMU_IMTINTREN                            REG32((FMU) + 0x000000E4U)                                /*!< FMU INIT work mode timeout interrupt request enable register */
#define FMU_TCLOCK                               REG32((FMU) + 0x000000F0U)                                /*!< FMU temporary configuration lock register  */
#define FMU_PCLOCK                               REG32((FMU) + 0x000000F4U)                                /*!< FMU permanent Configuration Lock register */
#define FMU_FOT                                  REG32((FMU) + 0x000000F8U)                                /*!< FMU fault output timer register */
#define FMU_CMINTREN                             REG32((FMU) + 0x000000FCU)                                /*!< FMU fault group CAUTION work mode interrupt request enable register */
#define FMU_FMNMIINTREN                          REG32((FMU) + 0x0000010CU)                                /*!< FMU fault group FAULT work mode NMI interrupt request enable register */
#define FMU_FPOEN                                REG32((FMU) + 0x0000011CU)                                /*!< FMU fault group FFIO output enable register */
#define FMU_GPOEN                                REG32((FMU) + 0x00000120U)                                /*!< FMU fault group GFIO output enable register */
#define FMU_FHTOEN                               REG32((FMU) + 0x00000124U)                                /*!< FMU fault holding timer output enable register */
#define FMU_CMCNT                                REG32((FMU) + 0x0000012CU)                                /*!< FMU fault group CAUTION work mode counter register */
#define FMU_IMCNT                                REG32((FMU) + 0x00000134U)                                /*!< FMU fault group INIT work mode counter register  */
#define FMU_FOCNT                                REG32((FMU) + 0x00000138U)                                /*!< FMU fatal fault output counter register */
#define FMU_GOCNT                                REG32((FMU) + 0x0000013CU)                                /*!< FMU general fault output counter register */
#define FMU_FGTSEN(x)                            REG32((uint32_t)(FMU_FGTSEN_BASE + ((x) << 2)))           /*!< FMU fault group trigger source enable register */
#define FMU_FGTSSTAT(x)                          REG32((uint32_t)(FMU_FGTSSTAT_BASE + ((x) << 2)))         /*!< FMU fault group trigger source status register */
#define FMU_FG_SWTEN(x)                          REG32((uint32_t)(FMU_FGSWTEN_BASE + ((x) << 2)))          /*!< FMU fault group software triggered fault enable register */
#define FMU_TMRES                                REG32((FMU) + 0x00000240U)                                /*!< FMU TMR enable and status register */

