sorosaulong-ux/gd32-test-project/Library/gd32a7xx_fmu.h
/* bits definitions */
/* FMU_CTL */
#define FMU_CTL_EOP                              BITS(0,4)                                                 /*!< execute operation bits */
#define FMU_CTL_OPSTAT                           BITS(6,7)                                                 /*!< operation status bits */
#define FMU_CTL_DBGEN                            BIT(9)                                                    /*!< debug mode enable bit */

/* FMU_CTLKEY */
#define FMU_CTLKEY_CTLKEY                        BITS(0,31)                                                /*!< unlock operation control key */

/* FMU_CFG */
#define FMU_CFG_GOMSET                           BITS(3,5)                                                 /*!< GFIO signals work mode set bits */
#define FMU_CFG_FOMSET                           BITS(6,8)                                                 /*!< FFIO signals work mode set bits */
#define FMU_CFG_FOPCFG                           BIT(9)                                                    /*!< FFIO signals polarity configuration bit */
#define FMU_CFG_GOPCFG                           BIT(10)                                                   /*!< GFIO signal polarity configuration bit */
#define FMU_CFG_FOMCFG                           BIT(11)                                                   /*!< FFIO signals work mode configuration bit */
#define FMU_CFG_FOPRE                            BITS(16,19)                                               /*!< FFIO signals time switching clock prescaler configuration bits */
#define FMU_CFG_GOSCFG                           BITS(20,21)                                               /*!< GFIO signals configuration bits */
#define FMU_CFG_FOSCFG                           BITS(22,23)                                               /*!< FFIO signals configuration bits */
#define FMU_CFG_FOSEN                            BIT(24)                                                   /*!< FFIO signals enable bit */
#define FMU_CFG_GOSEN                            BIT(25)                                                   /*!< GFIO signals enable bit */

/* FMU_FGCFG */
#define FMU_FGCFG_FGCFG0                         BIT(0)                                                    /*!< fault group recovery type configuration bit0 */
#define FMU_FGCFG_FGCFG1                         BIT(1)                                                    /*!< fault group recovery type configuration bit1 */
#define FMU_FGCFG_FGCFG2                         BIT(2)                                                    /*!< fault group recovery type configuration bit2 */
#define FMU_FGCFG_FGCFG3                         BIT(3)                                                    /*!< fault group recovery type configuration bit3 */
#define FMU_FGCFG_FGCFG4                         BIT(4)                                                    /*!< fault group recovery type configuration bit4 */
#define FMU_FGCFG_FGCFG5                         BIT(5)                                                    /*!< fault group recovery type configuration bit5 */
#define FMU_FGCFG_FGCFG6                         BIT(6)                                                    /*!< fault group recovery type configuration bit6 */
#define FMU_FGCFG_FGCFG7                         BIT(7)                                                    /*!< fault group recovery type configuration bit7 */
#define FMU_FGCFG_FGCFG8                         BIT(8)                                                    /*!< fault group recovery type configuration bit8 */
#define FMU_FGCFG_FGCFG9                         BIT(9)                                                    /*!< fault group recovery type configuration bit9 */
#define FMU_FGCFG_FGCFG10                        BIT(10)                                                   /*!< fault group recovery type configuration bit10 */
#define FMU_FGCFG_FGCFG11                        BIT(11)                                                   /*!< fault group recovery type configuration bit11 */

/* FMU_FGSUBSRCFG */
#define FMU_FGSUBSRCFG_RST0                      BITS(0,1)                                                 /*!< fault group subsystem reset reaction configuration  bits0 */
#define FMU_FGSUBSRCFG_RST1                      BITS(2,3)                                                 /*!< fault group subsystem reset reaction configuration  bits1 */
#define FMU_FGSUBSRCFG_RST2                      BITS(4,5)                                                 /*!< fault group subsystem reset reaction configuration  bits2 */
#define FMU_FGSUBSRCFG_RST3                      BITS(6,7)                                                 /*!< fault group subsystem reset reaction configuration  bits3 */
#define FMU_FGSUBSRCFG_RST4                      BITS(8,9)                                                 /*!< fault group subsystem reset reaction configuration  bits4 */
#define FMU_FGSUBSRCFG_RST5                      BITS(10,11)                                               /*!< fault group subsystem reset reaction configuration  bits5 */
#define FMU_FGSUBSRCFG_RST6                      BITS(12,13)                                               /*!< fault group subsystem reset reaction configuration  bits6 */
#define FMU_FGSUBSRCFG_RST7                      BITS(14,15)                                               /*!< fault group subsystem reset reaction configuration  bits7 */
#define FMU_FGSUBSRCFG_RST8                      BITS(16,17)                                               /*!< fault group subsystem reset reaction configuration  bits8 */
#define FMU_FGSUBSRCFG_RST9                      BITS(18,19)                                               /*!< fault group subsystem reset reaction configuration  bits9 */
#define FMU_FGSUBSRCFG_RST10                     BITS(20,21)                                               /*!< fault group subsystem reset reaction configuration  bits10 */
#define FMU_FGSUBSRCFG_RST11                     BITS(22,23)                                               /*!< fault group subsystem reset reaction configuration  bits11 */

/* FMU_FGSTAT */
#define FMU_FGSTAT_FGSTAT0                       BIT(0)                                                    /*!< fault group fault status bit0 */
#define FMU_FGSTAT_FGSTAT1                       BIT(1)                                                    /*!< fault group fault status bit1 */
#define FMU_FGSTAT_FGSTAT2                       BIT(2)                                                    /*!< fault group fault status bit2 */
#define FMU_FGSTAT_FGSTAT3                       BIT(3)                                                    /*!< fault group fault status bit3 */
#define FMU_FGSTAT_FGSTAT4                       BIT(4)                                                    /*!< fault group fault status bit4 */
#define FMU_FGSTAT_FGSTAT5                       BIT(5)                                                    /*!< fault group fault status bit5 */
#define FMU_FGSTAT_FGSTAT6                       BIT(6)                                                    /*!< fault group fault status bit6 */
#define FMU_FGSTAT_FGSTAT7                       BIT(7)                                                    /*!< fault group fault status bit7 */
#define FMU_FGSTAT_FGSTAT8                       BIT(8)                                                    /*!< fault group fault status bit8 */
#define FMU_FGSTAT_FGSTAT9                       BIT(9)                                                    /*!< fault group fault status bit9 */
#define FMU_FGSTAT_FGSTAT10                      BIT(10)                                                   /*!< fault group fault status bit10 */
#define FMU_FGSTAT_FGSTAT11                      BIT(11)                                                   /*!< fault group fault status bit11 */

/* FMU_FGKEY */
#define FMU_FGKEY_FGKEY                          BITS(0,31)                                                /*!< unlock fault group status register key */

