sorosaulong-ux/gd32-test-project/Library/gd32a7xx_fmu.h
/* FMU_FGEN */
#define FMU_FGEN_FGEN0                           BIT(0)                                                    /*!< fault group enable bit0 */
#define FMU_FGEN_FGEN1                           BIT(1)                                                    /*!< fault group enable bit1 */
#define FMU_FGEN_FGEN2                           BIT(2)                                                    /*!< fault group enable bit2 */
#define FMU_FGEN_FGEN3                           BIT(3)                                                    /*!< fault group enable bit3 */
#define FMU_FGEN_FGEN4                           BIT(4)                                                    /*!< fault group enable bit4 */
#define FMU_FGEN_FGEN5                           BIT(5)                                                    /*!< fault group enable bit5 */
#define FMU_FGEN_FGEN6                           BIT(6)                                                    /*!< fault group enable bit6 */
#define FMU_FGEN_FGEN7                           BIT(7)                                                    /*!< fault group enable bit7 */
#define FMU_FGEN_FGEN8                           BIT(8)                                                    /*!< fault group enable bit8 */
#define FMU_FGEN_FGEN9                           BIT(9)                                                    /*!< fault group enable bit9 */
#define FMU_FGEN_FGEN10                          BIT(10)                                                   /*!< fault group enable bit10 */
#define FMU_FGEN_FGEN11                          BIT(11)                                                   /*!< fault group enable bit11 */

/* FMU_FGCMTEN */
#define FMU_FGCMTEN_FGCMTEN0                     BIT(0)                                                    /*!< fault group CAUTION work mode timeout enable bit0 */
#define FMU_FGCMTEN_FGCMTEN1                     BIT(1)                                                    /*!< fault group CAUTION work mode timeout enable bit1 */
#define FMU_FGCMTEN_FGCMTEN2                     BIT(2)                                                    /*!< fault group CAUTION work mode timeout enable bit2 */
#define FMU_FGCMTEN_FGCMTEN3                     BIT(3)                                                    /*!< fault group CAUTION work mode timeout enable bit3 */
#define FMU_FGCMTEN_FGCMTEN4                     BIT(4)                                                    /*!< fault group CAUTION work mode timeout enable bit4 */
#define FMU_FGCMTEN_FGCMTEN5                     BIT(5)                                                    /*!< fault group CAUTION work mode timeout enable bit5 */
#define FMU_FGCMTEN_FGCMTEN6                     BIT(6)                                                    /*!< fault group CAUTION work mode timeout enable bit6 */
#define FMU_FGCMTEN_FGCMTEN7                     BIT(7)                                                    /*!< fault group CAUTION work mode timeout enable bit7 */
#define FMU_FGCMTEN_FGCMTEN8                     BIT(8)                                                    /*!< fault group CAUTION work mode timeout enable bit8 */
#define FMU_FGCMTEN_FGCMTEN9                     BIT(9)                                                    /*!< fault group CAUTION work mode timeout enable bit9 */
#define FMU_FGCMTEN_FGCMTEN10                    BIT(10)                                                   /*!< fault group CAUTION work mode timeout enable bit10 */
#define FMU_FGCMTEN_FGCMTEN11                    BIT(11)                                                   /*!< fault group CAUTION work mode timeout enable bit11 */

/* FMU_FGCMTVAL */
#define FMU_FGCMTVAL_FGCMTVAL                    BITS(0,31)                                                /*!< fault group CAUTION work mode timeout value bits */

/* FMU_IMTVAL */
#define FMU_IMTVAL_IMTVAL                        BITS(0,2)                                                 /*!< FMU INIT work mode timeout value bits */

/* FMU_FPCTL */ 
#define FMU_FPCTL_FPO0                           BIT(0)                                                    /*!< FFIO0 output signal configuration bit */
#define FMU_FPCTL_FPO1                           BIT(1)                                                    /*!< FFIO1 output signal configuration bit */
#define FMU_FPCTL_GPO                            BIT(2)                                                    /*!< GFIO output signal configuration bit */
#define FMU_FPCTL_FPI0                           BIT(4)                                                    /*!< FFIO0 signal input status */
#define FMU_FPCTL_FPI1                           BIT(5)                                                    /*!< FFIO1 signal input status */
#define FMU_FPCTL_GPI                            BIT(6)                                                    /*!< GFIO signal input status */

/* FMU_STAT */
#define FMU_STAT_FCSTAT                          BITS(0,2)                                                 /*!< FMU current work mode state bits */
#define FMU_STAT_FSTAT                           BIT(3)                                                    /*!< FMU faulty state bit */
#define FMU_STAT_FPSTAT                          BITS(4,5)                                                 /*!< FFIO signal states */
#define FMU_STAT_GPSTAT                          BIT(6)                                                    /*!< GFIO signal states */

/* FMU_NTCHSTAT */
#define FMU_NTCHSTAT_NTCHSTAT0                   BIT(0)                                                    /*!< NORMAL transform to CAUTION work mode hold status bit0 */
#define FMU_NTCHSTAT_NTCHSTAT1                   BIT(1)                                                    /*!< NORMAL transform to CAUTION work mode hold status bit1 */
#define FMU_NTCHSTAT_NTCHSTAT2                   BIT(2)                                                    /*!< NORMAL transform to CAUTION work mode hold status bit2 */
#define FMU_NTCHSTAT_NTCHSTAT3                   BIT(3)                                                    /*!< NORMAL transform to CAUTION work mode hold status bit3 */
#define FMU_NTCHSTAT_NTCHSTAT4                   BIT(4)                                                    /*!< NORMAL transform to CAUTION work mode hold status bit4 */
#define FMU_NTCHSTAT_NTCHSTAT5                   BIT(5)                                                    /*!< NORMAL transform to CAUTION work mode hold status bit5 */
#define FMU_NTCHSTAT_NTCHSTAT6                   BIT(6)                                                    /*!< NORMAL transform to CAUTION work mode hold status bit6 */
#define FMU_NTCHSTAT_NTCHSTAT7                   BIT(7)                                                    /*!< NORMAL transform to CAUTION work mode hold status bit7 */
#define FMU_NTCHSTAT_NTCHSTAT8                   BIT(8)                                                    /*!< NORMAL transform to CAUTION work mode hold status bit8 */
#define FMU_NTCHSTAT_NTCHSTAT9                   BIT(9)                                                    /*!< NORMAL transform to CAUTION work mode hold status bit9 */
#define FMU_NTCHSTAT_NTCHSTAT10                  BIT(10)                                                   /*!< NORMAL transform to CAUTION work mode hold status bit10 */
#define FMU_NTCHSTAT_NTCHSTAT11                  BIT(11)                                                   /*!< NORMAL transform to CAUTION work mode hold status bit11 */

/* FMU_CTFHSTAT */
#define FMU_CTFHSTAT_CTFHSTAT0                   BIT(0)                                                    /*!< CAUTION transform to FAULT work mode hold status bit0 */
#define FMU_CTFHSTAT_CTFHSTAT1                   BIT(1)                                                    /*!< CAUTION transform to FAULT work mode hold status bit1 */
#define FMU_CTFHSTAT_CTFHSTAT2                   BIT(2)                                                    /*!< CAUTION transform to FAULT work mode hold status bit2 */
#define FMU_CTFHSTAT_CTFHSTAT3                   BIT(3)                                                    /*!< CAUTION transform to FAULT work mode hold status bit3 */
#define FMU_CTFHSTAT_CTFHSTAT4                   BIT(4)                                                    /*!< CAUTION transform to FAULT work mode hold status bit4 */
#define FMU_CTFHSTAT_CTFHSTAT5                   BIT(5)                                                    /*!< CAUTION transform to FAULT work mode hold status bit5 */
#define FMU_CTFHSTAT_CTFHSTAT6                   BIT(6)                                                    /*!< CAUTION transform to FAULT work mode hold status bit6 */
#define FMU_CTFHSTAT_CTFHSTAT7                   BIT(7)                                                    /*!< CAUTION transform to FAULT work mode hold status bit7 */
#define FMU_CTFHSTAT_CTFHSTAT8                   BIT(8)                                                    /*!< CAUTION transform to FAULT work mode hold status bit8 */
#define FMU_CTFHSTAT_CTFHSTAT9                   BIT(9)                                                    /*!< CAUTION transform to FAULT work mode hold status bit9 */
#define FMU_CTFHSTAT_CTFHSTAT10                  BIT(10)                                                   /*!< CAUTION transform to FAULT work mode hold status bit10 */
#define FMU_CTFHSTAT_CTFHSTAT11                  BIT(11)                                                   /*!< CAUTION transform to FAULT work mode hold status bit11 */

/* FMU_NTFHSTAT */
#define FMU_NTFHSTAT_NTFHSTAT0                   BIT(0)                                                    /*!< NORMAL transform to FAULT work mode hold status bit0 */
#define FMU_NTFHSTAT_NTFHSTAT1                   BIT(1)                                                    /*!< NORMAL transform to FAULT work mode hold status bit1 */
#define FMU_NTFHSTAT_NTFHSTAT2                   BIT(2)                                                    /*!< NORMAL transform to FAULT work mode hold status bit2 */
#define FMU_NTFHSTAT_NTFHSTAT3                   BIT(3)                                                    /*!< NORMAL transform to FAULT work mode hold status bit3 */
#define FMU_NTFHSTAT_NTFHSTAT4                   BIT(4)                                                    /*!< NORMAL transform to FAULT work mode hold status bit4 */
#define FMU_NTFHSTAT_NTFHSTAT5                   BIT(5)                                                    /*!< NORMAL transform to FAULT work mode hold status bit5 */
#define FMU_NTFHSTAT_NTFHSTAT6                   BIT(6)                                                    /*!< NORMAL transform to FAULT work mode hold status bit6 */
#define FMU_NTFHSTAT_NTFHSTAT7                   BIT(7)                                                    /*!< NORMAL transform to FAULT work mode hold status bit7 */
#define FMU_NTFHSTAT_NTFHSTAT8                   BIT(8)                                                    /*!< NORMAL transform to FAULT work mode hold status bit8 */
#define FMU_NTFHSTAT_NTFHSTAT9                   BIT(9)                                                    /*!< NORMAL transform to FAULT work mode hold status bit9 */
#define FMU_NTFHSTAT_NTFHSTAT10                  BIT(10)                                                   /*!< NORMAL transform to FAULT work mode hold status bit10 */
#define FMU_NTFHSTAT_NTFHSTAT11                  BIT(11)                                                   /*!< NORMAL transform to FAULT work mode hold status bit11 */

/* FMU_FTCHSTAT */
#define FMU_FTCHSTAT_FTCHSTAT0                   BIT(0)                                                    /*!< FAULT transform to CAUTION work mode hold status bit0 */
#define FMU_FTCHSTAT_FTCHSTAT1                   BIT(1)                                                    /*!< FAULT transform to CAUTION work mode hold status bit1 */
#define FMU_FTCHSTAT_FTCHSTAT2                   BIT(2)                                                    /*!< FAULT transform to CAUTION work mode hold status bit2 */
#define FMU_FTCHSTAT_FTCHSTAT3                   BIT(3)                                                    /*!< FAULT transform to CAUTION work mode hold status bit3 */
#define FMU_FTCHSTAT_FTCHSTAT4                   BIT(4)                                                    /*!< FAULT transform to CAUTION work mode hold status bit4 */
#define FMU_FTCHSTAT_FTCHSTAT5                   BIT(5)                                                    /*!< FAULT transform to CAUTION work mode hold status bit5 */
#define FMU_FTCHSTAT_FTCHSTAT6                   BIT(6)                                                    /*!< FAULT transform to CAUTION work mode hold status bit6 */
#define FMU_FTCHSTAT_FTCHSTAT7                   BIT(7)                                                    /*!< FAULT transform to CAUTION work mode hold status bit7 */
#define FMU_FTCHSTAT_FTCHSTAT8                   BIT(8)                                                    /*!< FAULT transform to CAUTION work mode hold status bit8 */
#define FMU_FTCHSTAT_FTCHSTAT9                   BIT(9)                                                    /*!< FAULT transform to CAUTION work mode hold status bit9 */
#define FMU_FTCHSTAT_FTCHSTAT10                  BIT(10)                                                   /*!< FAULT transform to CAUTION work mode hold status bit10 */
#define FMU_FTCHSTAT_FTCHSTAT11                  BIT(11)                                                   /*!< FAULT transform to CAUTION work mode hold status bit11 */

/* FMU_FFGNCFG */
#define FMU_FFGNCFG_NUM                          BITS(0,7)                                                 /*!< injection fake fake FG fault number */
#define FMU_FFGNCFG_FFGEN                        BITS(8,9)                                                 /*!< fake FG fault enable enable */

/* FMU_INTRPD */
#define FMU_INTRPD_INITINTRPD                    BIT(0)                                                    /*!< INIT work mode timeout interrupt request pending bit */
#define FMU_INTRPD_CAUINTRPD                     BIT(1)                                                    /*!< CAUTION work mode interrupt request pending bit */
#define FMU_INTRPD_NMIINTRPD                     BIT(2)                                                    /*!< NMI interrupt request pending bit */

/* FMU_IMTINTREN */
#define FMU_IMTINTREN_INITTIE                    BIT(0)                                                    /*!< INIT work mode timeout interrupt enable bit */

/* FMU_TCLOCK */
#define FMU_TCLOCK_TCLK                          BITS(0,8)                                                 /*!< INIT work mode transition temporary lock bits */

/* FMU_PCLOCK */
#define FMU_PCLOCK_VPCLK                         BITS(0,8)                                                 /*!< INIT work mode transition permanent lock bits */

/* FMU_FOT */
#define FMU_FOT_FOT                              BITS(0,13)                                                /*!< fault output(FFIO) timer configure bits */

/* FMU_CMINTREN */ 
#define FMU_CMINTREN_CMINTREN0                   BIT(0)                                                    /*!< CAUTION work mode interrupt request enable bit0 */
#define FMU_CMINTREN_CMINTREN1                   BIT(1)                                                    /*!< CAUTION work mode interrupt request enable bit1 */
#define FMU_CMINTREN_CMINTREN2                   BIT(2)                                                    /*!< CAUTION work mode interrupt request enable bit2 */
#define FMU_CMINTREN_CMINTREN3                   BIT(3)                                                    /*!< CAUTION work mode interrupt request enable bit3 */
#define FMU_CMINTREN_CMINTREN4                   BIT(4)                                                    /*!< CAUTION work mode interrupt request enable bit4 */
#define FMU_CMINTREN_CMINTREN5                   BIT(5)                                                    /*!< CAUTION work mode interrupt request enable bit5 */
#define FMU_CMINTREN_CMINTREN6                   BIT(6)                                                    /*!< CAUTION work mode interrupt request enable bit6 */
#define FMU_CMINTREN_CMINTREN7                   BIT(7)                                                    /*!< CAUTION work mode interrupt request enable bit7 */
#define FMU_CMINTREN_CMINTREN8                   BIT(8)                                                    /*!< CAUTION work mode interrupt request enable bit8 */
#define FMU_CMINTREN_CMINTREN9                   BIT(9)                                                    /*!< CAUTION work mode interrupt request enable bit9 */
#define FMU_CMINTREN_CMINTREN10                  BIT(10)                                                   /*!< CAUTION work mode interrupt request enable bit10 */
#define FMU_CMINTREN_CMINTREN11                  BIT(11)                                                   /*!< CAUTION work mode interrupt request enable bit11 */

/* FMU_FMNMIINTREN*/
#define FMU_FMNMIINTREN_FMNMIINTREN0             BIT(0)                                                    /*!< FAULT work mode NMI interrupt request enable bit0 */
#define FMU_FMNMIINTREN_FMNMIINTREN1             BIT(1)                                                    /*!< FAULT work mode NMI interrupt request enable bit1 */
#define FMU_FMNMIINTREN_FMNMIINTREN2             BIT(2)                                                    /*!< FAULT work mode NMI interrupt request enable bit2 */
#define FMU_FMNMIINTREN_FMNMIINTREN3             BIT(3)                                                    /*!< FAULT work mode NMI interrupt request enable bit3 */
#define FMU_FMNMIINTREN_FMNMIINTREN4             BIT(4)                                                    /*!< FAULT work mode NMI interrupt request enable bit4 */
#define FMU_FMNMIINTREN_FMNMIINTREN5             BIT(5)                                                    /*!< FAULT work mode NMI interrupt request enable bit5 */
#define FMU_FMNMIINTREN_FMNMIINTREN6             BIT(6)                                                    /*!< FAULT work mode NMI interrupt request enable bit6 */
#define FMU_FMNMIINTREN_FMNMIINTREN7             BIT(7)                                                    /*!< FAULT work mode NMI interrupt request enable bit7 */
#define FMU_FMNMIINTREN_FMNMIINTREN8             BIT(8)                                                    /*!< FAULT work mode NMI interrupt request enable bit8 */
#define FMU_FMNMIINTREN_FMNMIINTREN9             BIT(9)                                                    /*!< FAULT work mode NMI interrupt request enable bit9 */
#define FMU_FMNMIINTREN_FMNMIINTREN10            BIT(10)                                                   /*!< FAULT work mode NMI interrupt request enable bit10 */
#define FMU_FMNMIINTREN_FMNMIINTREN11            BIT(11)                                                   /*!< FAULT work mode NMI interrupt request enable bit11 */

/* FMU_FPOEN */
#define FMU_FPOEN_FPOEN0                         BIT(0)                                                    /*!< FAULT work mode FFIO signaling enable bit0 */
#define FMU_FPOEN_FPOEN1                         BIT(1)                                                    /*!< FAULT work mode FFIO signaling enable bit1 */
#define FMU_FPOEN_FPOEN2                         BIT(2)                                                    /*!< FAULT work mode FFIO signaling enable bit2 */
#define FMU_FPOEN_FPOEN3                         BIT(3)                                                    /*!< FAULT work mode FFIO signaling enable bit3 */
#define FMU_FPOEN_FPOEN4                         BIT(4)                                                    /*!< FAULT work mode FFIO signaling enable bit4 */
#define FMU_FPOEN_FPOEN5                         BIT(5)                                                    /*!< FAULT work mode FFIO signaling enable bit5 */
#define FMU_FPOEN_FPOEN6                         BIT(6)                                                    /*!< FAULT work mode FFIO signaling enable bit6 */
#define FMU_FPOEN_FPOEN7                         BIT(7)                                                    /*!< FAULT work mode FFIO signaling enable bit7 */
#define FMU_FPOEN_FPOEN8                         BIT(8)                                                    /*!< FAULT work mode FFIO signaling enable bit8 */
#define FMU_FPOEN_FPOEN9                         BIT(9)                                                    /*!< FAULT work mode FFIO signaling enable bit9 */
#define FMU_FPOEN_FPOEN10                        BIT(10)                                                   /*!< FAULT work mode FFIO signaling enable bit10 */
#define FMU_FPOEN_FPOEN11                        BIT(11)                                                   /*!< FAULT work mode FFIO signaling enable bit11 */

/* FMU_GPOEN */
#define FMU_GPOEN_GPOEN0                         BIT(0)                                                    /*!< FAULT work mode GFIO signaling enable bit0 */
#define FMU_GPOEN_GPOEN1                         BIT(1)                                                    /*!< FAULT work mode GFIO signaling enable bit1 */
#define FMU_GPOEN_GPOEN2                         BIT(2)                                                    /*!< FAULT work mode GFIO signaling enable bit2 */
#define FMU_GPOEN_GPOEN3                         BIT(3)                                                    /*!< FAULT work mode GFIO signaling enable bit3 */
#define FMU_GPOEN_GPOEN4                         BIT(4)                                                    /*!< FAULT work mode GFIO signaling enable bit4 */
#define FMU_GPOEN_GPOEN5                         BIT(5)                                                    /*!< FAULT work mode GFIO signaling enable bit5 */
#define FMU_GPOEN_GPOEN6                         BIT(6)                                                    /*!< FAULT work mode GFIO signaling enable bit6 */
#define FMU_GPOEN_GPOEN7                         BIT(7)                                                    /*!< FAULT work mode GFIO signaling enable bit7 */
#define FMU_GPOEN_GPOEN8                         BIT(8)                                                    /*!< FAULT work mode GFIO signaling enable bit8 */
#define FMU_GPOEN_GPOEN9                         BIT(9)                                                    /*!< FAULT work mode GFIO signaling enable bit9 */
#define FMU_GPOEN_GPOEN10                        BIT(10)                                                   /*!< FAULT work mode GFIO signaling enable bit10 */
#define FMU_GPOEN_GPOEN11                        BIT(11)                                                   /*!< FAULT work mode GFIO signaling enable bit11 */

