sorosaulong-ux/gd32-test-project/Library/gd32a7xx_fmu.h
/* FMU_FHTOEN */
#define FMU_FHTOEN_FHTOEN0                       BIT(0)                                                    /*!< FAULT work mode holding timer output enable bit0 */
#define FMU_FHTOEN_FHTOEN1                       BIT(1)                                                    /*!< FAULT work mode holding timer output enable bit1 */
#define FMU_FHTOEN_FHTOEN2                       BIT(2)                                                    /*!< FAULT work mode holding timer output enable bit2 */
#define FMU_FHTOEN_FHTOEN3                       BIT(3)                                                    /*!< FAULT work mode holding timer output enable bit3 */
#define FMU_FHTOEN_FHTOEN4                       BIT(4)                                                    /*!< FAULT work mode holding timer output enable bit4 */
#define FMU_FHTOEN_FHTOEN5                       BIT(5)                                                    /*!< FAULT work mode holding timer output enable bit5 */
#define FMU_FHTOEN_FHTOEN6                       BIT(6)                                                    /*!< FAULT work mode holding timer output enable bit6 */
#define FMU_FHTOEN_FHTOEN7                       BIT(7)                                                    /*!< FAULT work mode holding timer output enable bit7 */
#define FMU_FHTOEN_FHTOEN8                       BIT(8)                                                    /*!< FAULT work mode holding timer output enable bit8 */
#define FMU_FHTOEN_FHTOEN9                       BIT(9)                                                    /*!< FAULT work mode holding timer output enable bit9 */
#define FMU_FHTOEN_FHTOEN10                      BIT(10)                                                   /*!< FAULT work mode holding timer output enable bit10 */
#define FMU_FHTOEN_FHTOEN11                      BIT(11)                                                   /*!< FAULT work mode holding timer output enable bit11 */

/* FMU_CMCNT */
#define FMU_CMCNT_CMCNT                          BITS(0,31)                                                /*!< CAUTION work mode timer count configure bits */

/* FMU_IMCNT */
#define FMU_IMCNT_IMCNT                          BITS(0,31)                                                /*!< INIT work mode timer count configure bits */

/* FMU_FOCNT */
#define FMU_FOCNT_FOCNT                          BITS(0,31)                                                /*!< fatal fault output timer count configure bits */

/* FMU_GOCNT */
#define FMU_GOCNT_GOCNT                          BITS(0,31)                                                /*!< general fault output timer count configure bits */

/* FMU_FGINTEN(x) (x=0...4) */
#define FMU_FGTSEN_FGTSEN0                       BIT(0)                                                    /*!< FG trigger source enable bit0 */
#define FMU_FGTSEN_FGTSEN1                       BIT(1)                                                    /*!< FG trigger source enable bit1 */
#define FMU_FGTSEN_FGTSEN2                       BIT(2)                                                    /*!< FG trigger source enable bit2 */
#define FMU_FGTSEN_FGTSEN3                       BIT(3)                                                    /*!< FG trigger source enable bit3 */
#define FMU_FGTSEN_FGTSEN4                       BIT(4)                                                    /*!< FG trigger source enable bit4 */
#define FMU_FGTSEN_FGTSEN5                       BIT(5)                                                    /*!< FG trigger source enable bit5 */
#define FMU_FGTSEN_FGTSEN6                       BIT(6)                                                    /*!< FG trigger source enable bit6 */
#define FMU_FGTSEN_FGTSEN7                       BIT(7)                                                    /*!< FG trigger source enable bit7 */
#define FMU_FGTSEN_FGTSEN8                       BIT(8)                                                    /*!< FG trigger source enable bit8 */
#define FMU_FGTSEN_FGTSEN9                       BIT(9)                                                    /*!< FG trigger source enable bit9 */
#define FMU_FGTSEN_FGTSEN10                      BIT(10)                                                   /*!< FG trigger source enable bit10 */
#define FMU_FGTSEN_FGTSEN11                      BIT(11)                                                   /*!< FG trigger source enable bit11 */
#define FMU_FGTSEN_FGTSEN12                      BIT(12)                                                   /*!< FG trigger source enable bit12 */
#define FMU_FGTSEN_FGTSEN13                      BIT(13)                                                   /*!< FG trigger source enable bit13 */
#define FMU_FGTSEN_FGTSEN14                      BIT(14)                                                   /*!< FG trigger source enable bit14 */
#define FMU_FGTSEN_FGTSEN15                      BIT(15)                                                   /*!< FG trigger source enable bit16 */
#define FMU_FGTSEN_FGTSEN16                      BIT(16)                                                   /*!< FG trigger source enable bit16 */
#define FMU_FGTSEN_FGTSEN17                      BIT(17)                                                   /*!< FG trigger source enable bit17 */
#define FMU_FGTSEN_FGTSEN18                      BIT(18)                                                   /*!< FG trigger source enable bit18 */
#define FMU_FGTSEN_FGTSEN19                      BIT(19)                                                   /*!< FG trigger source enable bit19 */
#define FMU_FGTSEN_FGTSEN20                      BIT(20)                                                   /*!< FG trigger source enable bit20 */
#define FMU_FGTSEN_FGTSEN21                      BIT(21)                                                   /*!< FG trigger source enable bit21 */
#define FMU_FGTSEN_FGTSEN22                      BIT(22)                                                   /*!< FG trigger source enable bit22 */
#define FMU_FGTSEN_FGTSEN23                      BIT(23)                                                   /*!< FG trigger source enable bit23 */
#define FMU_FGTSEN_FGTSEN24                      BIT(24)                                                   /*!< FG trigger source enable bit24 */
#define FMU_FGTSEN_FGTSEN25                      BIT(25)                                                   /*!< FG trigger source enable bit25 */
#define FMU_FGTSEN_FGTSEN26                      BIT(26)                                                   /*!< FG trigger source enable bit26 */
#define FMU_FGTSEN_FGTSEN27                      BIT(27)                                                   /*!< FG trigger source enable bit27 */
#define FMU_FGTSEN_FGTSEN28                      BIT(28)                                                   /*!< FG trigger source enable bit28 */
#define FMU_FGTSEN_FGTSEN29                      BIT(29)                                                   /*!< FG trigger source enable bit29 */
#define FMU_FGTSEN_FGTSEN30                      BIT(30)                                                   /*!< FG trigger source enable bit30 */
#define FMU_FGTSEN_FGTSEN31                      BIT(31)                                                   /*!< FG trigger source enable bit31 */

