sorosaulong-ux/gd32-test-project/Library/gd32a7xx_fmu.h
/* FMU_FGTSSTAT(x) (x=0...4) */
#define FMU_FGTSSTAT_FGTSSTAT0                   BIT(0)                                                    /*!< FG trigger source status bit0 */
#define FMU_FGTSSTAT_FGTSSTAT1                   BIT(1)                                                    /*!< FG trigger source status bit 1 */
#define FMU_FGTSSTAT_FGTSSTAT2                   BIT(2)                                                    /*!< FG trigger source status bit 2 */
#define FMU_FGTSSTAT_FGTSSTAT3                   BIT(3)                                                    /*!< FG trigger source status bit 3 */
#define FMU_FGTSSTAT_FGTSSTAT4                   BIT(4)                                                    /*!< FG trigger source status bit 4 */
#define FMU_FGTSSTAT_FGTSSTAT5                   BIT(5)                                                    /*!< FG trigger source status bit 5 */
#define FMU_FGTSSTAT_FGTSSTAT6                   BIT(6)                                                    /*!< FG trigger source status bit 6 */
#define FMU_FGTSSTAT_FGTSSTAT7                   BIT(7)                                                    /*!< FG trigger source status bit 7 */
#define FMU_FGTSSTAT_FGTSSTAT8                   BIT(8)                                                    /*!< FG trigger source status bit 8 */
#define FMU_FGTSSTAT_FGTSSTAT9                   BIT(9)                                                    /*!< FG trigger source status bit 9 */
#define FMU_FGTSSTAT_FGTSSTAT10                  BIT(10)                                                   /*!< FG trigger source status bit 10 */
#define FMU_FGTSSTAT_FGTSSTAT11                  BIT(11)                                                   /*!< FG trigger source status bit 11 */
#define FMU_FGTSSTAT_FGTSSTAT12                  BIT(12)                                                   /*!< FG trigger source status bit 12 */
#define FMU_FGTSSTAT_FGTSSTAT13                  BIT(13)                                                   /*!< FG trigger source status bit 13 */
#define FMU_FGTSSTAT_FGTSSTAT14                  BIT(14)                                                   /*!< FG trigger source status bit 14 */
#define FMU_FGTSSTAT_FGTSSTAT15                  BIT(15)                                                   /*!< FG trigger source status bit 16 */
#define FMU_FGTSSTAT_FGTSSTAT16                  BIT(16)                                                   /*!< FG trigger source status bit 16 */
#define FMU_FGTSSTAT_FGTSSTAT17                  BIT(17)                                                   /*!< FG trigger source status bit 17 */
#define FMU_FGTSSTAT_FGTSSTAT18                  BIT(18)                                                   /*!< FG trigger source status bit 18 */
#define FMU_FGTSSTAT_FGTSSTAT19                  BIT(19)                                                   /*!< FG trigger source status bit 19 */
#define FMU_FGTSSTAT_FGTSSTAT20                  BIT(20)                                                   /*!< FG trigger source status bit 20 */
#define FMU_FGTSSTAT_FGTSSTAT21                  BIT(21)                                                   /*!< FG trigger source status bit 21 */
#define FMU_FGTSSTAT_FGTSSTAT22                  BIT(22)                                                   /*!< FG trigger source status bit 22 */
#define FMU_FGTSSTAT_FGTSSTAT23                  BIT(23)                                                   /*!< FG trigger source status bit 23 */
#define FMU_FGTSSTAT_FGTSSTAT24                  BIT(24)                                                   /*!< FG trigger source status bit 24 */
#define FMU_FGTSSTAT_FGTSSTAT25                  BIT(25)                                                   /*!< FG trigger source status bit 25 */
#define FMU_FGTSSTAT_FGTSSTAT26                  BIT(26)                                                   /*!< FG trigger source status bit 26 */
#define FMU_FGTSSTAT_FGTSSTAT27                  BIT(27)                                                   /*!< FG trigger source status bit 27 */
#define FMU_FGTSSTAT_FGTSSTAT28                  BIT(28)                                                   /*!< FG trigger source status bit 28 */
#define FMU_FGTSSTAT_FGTSSTAT29                  BIT(29)                                                   /*!< FG trigger source status bit 29 */
#define FMU_FGTSSTAT_FGTSSTAT30                  BIT(30)                                                   /*!< FG trigger source status bit 30 */
#define FMU_FGTSSTAT_FGTSSTAT31                  BIT(31)                                                   /*!< FG trigger source status bit 31 */

/* FMU_FGSWTEN(x) (x=0...2) */
#define FMU_FGSWTEN_FGSWTEN0                     BITS(0,1)                                                 /*!< Software triggered fault enable bits0 */
#define FMU_FGSWTEN_FGSWTEN1                     BITS(2,3)                                                 /*!< Software triggered fault enable bits1 */
#define FMU_FGSWTEN_FGSWTEN2                     BITS(4,5)                                                 /*!< Software triggered fault enable bits2 */
#define FMU_FGSWTEN_FGSWTEN3                     BITS(6,7)                                                 /*!< Software triggered fault enable bits3 */
#define FMU_FGSWTEN_FGSWTEN4                     BITS(8,9)                                                 /*!< Software triggered fault enable bits4 */
#define FMU_FGSWTEN_FGSWTEN5                     BITS(10,11)                                               /*!< Software triggered fault enable bits5 */
#define FMU_FGSWTEN_FGSWTEN6                     BITS(12,13)                                               /*!< Software triggered fault enable bits6 */
#define FMU_FGSWTEN_FGSWTEN7                     BITS(14,15)                                               /*!< Software triggered fault enable bits7 */

/* FMU_TMRES */
#define FMU_TMRES_TMREN0                         BIT(0)                                                    /*!< TMR error output enable 0 */
#define FMU_TMRES_TMRS0                          BIT(1)                                                    /*!< DBGEN register TMR error status */
#define FMU_TMRES_TMREN1                         BIT(2)                                                    /*!< TMR error output enable bit 1 */
#define FMU_TMRES_TMRS1                          BIT(3)                                                    /*!< FOSEN, FOSCFG[1:0], GOSEN and GOSCFG[1:0] bits TMR error status */
#define FMU_TMRES_TMREN2                         BIT(4)                                                    /*!< TMR error output enable bit 2 */
#define FMU_TMRES_TMRS2                          BIT(5)                                                    /*!< FMU_FGCFG and FMU_FGEN registers TMR error status */

/* constants definitions */
/* FMU fault pin parameter struct definitions */
typedef struct
{
    uint32_t gosen;                                                                                        /*!< enable or disable GFIO signal */
    uint32_t fosen;                                                                                        /*!< enable or disable FFIO signals */
    uint32_t foscfg;                                                                                       /*!< configure FFIO signals */
    uint32_t goscfg;                                                                                       /*!< configure GFIO signal */
    uint32_t fopre;                                                                                        /*!< configure fatal fault output pin signals time switching clock prescaler */
    uint32_t fomcfg;                                                                                       /*!< configure FFIO signals work mode is consistent with FG fault or not when FMU is in INIT work mode */
    uint32_t gopcfg;                                                                                       /*!< configure GFIO signal polarity */
    uint32_t fopcfg;                                                                                       /*!< configure FFIO signal polarity */
    uint32_t fomset;                                                                                       /*!< set FFIO signals work mode */
    uint32_t gomset;                                                                                       /*!< set GFIO signal work mode */
}fmu_fio_parameter_struct;

/* FMU parameter struct definitions */
typedef struct
{
    uint16_t recovery_type;                                                                                /*!< fault recovery type (hardware recovery or software recovery) */
    ControlStatus sub_rst;                                                                                 /*!< configure fault group subsystem reset */
    ControlStatus fault_group_en;                                                                          /*!< configure fault group (enable or disable) */
    ControlStatus caution_timeout_en;                                                                      /*!< configure fault group CAUTION  work mode timeout (enable or disable) */
    uint32_t caution_timeout_value;                                                                        /*!< fault group CAUTION  work mode timeout value */
    uint32_t init_timeout_value;                                                                           /*!< INIT work mode timeout value */
    uint16_t faultout_timer_value;                                                                         /*!< fault output (FFIO) timer value */
    ControlStatus caution_int_en;                                                                          /*!< configure CAUTION work mode interrupt request (enable or disable) */
    ControlStatus nmi_en;                                                                                  /*!< configure NMI request (enable or disable) */
    ControlStatus ffio_output_en;                                                                          /*!< configure FFIO signals (enable or disable) */
    ControlStatus gfio_output_en;                                                                          /*!< configure GFIO signal (enable or disable) */
    ControlStatus gpo_en;                                                                                  /*!< configure FAULT work mode holding timer output (GPO) (enable or disable) */
}fmu_parameter_struct;

/* FMU execute operation definition */
typedef enum
{
    FMU_TRAN_INIT_WORK_MODE     = 0U,                                                                       /*!< FMU execute operation that transform to INIT work mode */
    FMU_TRAN_NORMAL_WORK_MODE   = 1U,                                                                       /*!< FMU execute operation that transform to NORMAL work mode */
    FMU_CLR_HOLDING_STATUS_REGS = 2U,                                                                       /*!< FMU execute operation that clear the hold status register */
    FMU_CLR_OPERATION           = 3U,                                                                       /*!< FMU execute operation that clear operation status */
    FMU_NO_EXE_OPERATION        = 4U,                                                                       /*!< FMU no execute operation */
}fmu_operation_enum;

