sorosaulong-ux/gd32-test-project/Library/gd32a7xx_fmu.h
typedef enum
{
    FMU_OPS_IDLE                = 0U,                                                                       /*!< FMU operation status is idle */
    FMU_OPS_ONGOING             = 1U,                                                                       /*!< FMU operation status is on going */
    FMU_OPS_NOTSUCCESS          = 2U,                                                                       /*!< FMU operation is not success */
    FMU_OPS_SUCCESS             = 3U                                                                        /*!< FMU operation is success */
}fmu_operation_status_enum;

/* fmu_lock_type_enum */
typedef enum
{
    FMU_LOCK_EOP1               = BIT(0),                                                                   /*!< EOP1 lock */
    FMU_LOCK_EOP2               = BIT(1),                                                                   /*!< EOP2 lock */
    FMU_LOCK_TRANS_TEMP         = BIT(2),                                                                   /*!< INIT work mode transition temporary lock  */
    FMU_LOCK_TRANS_PERM         = BIT(3),                                                                   /*!< INIT work mode transition permanent lock */
    FMU_LOCK_FG_STAT            = BIT(4)                                                                    /*!< FG status lock */
}fmu_lock_type_enum;

/* FMU fault reaction type enum */
typedef enum
{
    FMU_FRETN_CAUINT2CPU        = 0U,                                                                       /*!< FMU fault reaction type is CAUTION to CPU */
    FMU_FRETN_NMI2CPU           = 1U,                                                                       /*!< FMU fault reaction type is NMI to CPU */
    FMU_FRETN_SUBRST2RCU        = 2U,                                                                       /*!< FMU fault reaction type is subsystem reset to RCU */
    FMU_FRETN_RST2RCU           = 3U,                                                                       /*!< FMU fault reaction type is reset to RCU */
    FMU_FRETN_GPO               = 4U,                                                                       /*!< FMU fault reaction type is FAULT work status holding timer output */
    FMU_FRETN_GFIO              = 5U,                                                                       /*!< FMU fault reaction type is FG GFIO pin output */
    FMU_FRETN_FFIO              = 6U                                                                        /*!< FMU fault reaction type is FG FFIO pin output */
}fmu_fretn_type_enum;

/* FMU timer type enum */
typedef enum
{
    FMU_CAUTION_TIMEROUT        = 0U,                                                                        /*!< FG CAUTION work mode timerout value */
    FMU_INIT_TIMEROUT           = 1U,                                                                        /*!< FG INIT work mode timerout value */
    FMU_FAULT_OUTPUT_TIMER      = 2U                                                                         /*!< FG FAULT work mode timer */
}fmu_tim_type_enum;

/* FMU FFIO state type definition */
typedef enum
{
    FFIO_STATUS_LOW0_LOW1       = 0U,                                                                       /*!< FFIO0 and FFIO1 status are low */
    FFIO_STATUS_HIGH0_LOW1      = 1U,                                                                       /*!< FFIO0 status is high and FFIO1 status is low */
    FFIO_STATUS_LOW0_HIGH1      = 2U,                                                                       /*!< FFIO0 status is low and FFIO1 output is high */
    FFIO_STATUS_HIGH0_HIGH1     = 3U                                                                        /*!< FFIO0 and FFIO1 statuss are high */
}fmu_ffio_status_enum;

typedef enum
{
    FMU_NO_FAULTY               = 0U,                                                                       /*!< FMU not in faulty condition */
    FMU_IN_FAULTY               = 1U                                                                        /*!< FMU in faulty condition */
}fmu_faulty_status_enum;

/* FMU FFIO state type definition */
typedef enum
{
    FMU_STATUS_NORMAL           = 0U,                                                                       /*!< FMU the current is NORMAL status */
    FMU_STATUS_INIT             = 1U,                                                                       /*!< FMU the current is INIT status */
    FMU_STATUS_CAUTION          = 2U,                                                                       /*!< FMU the current is CAUTION status */
    FMU_STATUS_FAULT            = 3U                                                                        /*!< FMU the current is FAULT status */
}fmu_status_enum;

/* fmu_lock_type_enum */
typedef enum
{
    FMU_TRANS_N2C              = BIT(0),                                                                    /*!< FMU work mode transition type is NORMAL to CAUTION */
    FMU_TRANS_C2F              = BIT(1),                                                                    /*!< FMU work mode transition type is CAUTION to FAULT */
    FMU_TRANS_N2F              = BIT(2),                                                                    /*!< FMU work mode transition type is NORMAL to FAULT */
    FMU_TRANS_F2C              = BIT(3)                                                                     /*!< FMU work mode transition type is FAULT to CAUTION */
}fmu_trans_type_enum;

/* FMU interrupt type enum */
typedef enum
{
    FMU_INT_INIT                = 0U,                                                                       /*!< INIT timeout interrupt is pending */
    FMU_INT_CAUTION             = 1U,                                                                       /*!< CAUTION timeout interrupt is pending */
    FMU_INT_NMI                 = 2U                                                                        /*!< NMI interrupt */
}fmu_int_type_enum;

