sorosaulong-ux/gd32-test-project/Library/gd32a7xx_fmu.h
typedef enum
{
    FMU_CAUTION_WORK_MODE_CNT  = 0U,                                                                        /*!< FG CAUTION work mode counter */
    FMU_INIT_WORK_MODE_CNT     = 1U,                                                                        /*!< FG INIT work mode counter */
    FMU_FF_OUTPUT_CNT          = 2U,                                                                        /*!< fatal fault output counter */
    FMU_GF_OUTPUT_CNT          = 3U                                                                         /*!< general fault output counter */
}fmu_cnt_type_enum;

/* fmu_lock_type_enum */
typedef enum
{
    FMU_TME0_DBGEN           = BIT(0),                                                                      /*!< enable TMR error output 0 */
    FMU_TME1_FOS_GOS_ENCFG   = BIT(1),                                                                      /*!< enable TMR error output 1 */
    FMU_TME2_FG_ENCFG        = BIT(2)                                                                       /*!< enable TMR error output 2 */
}fmu_tmr_error_type_enum;

/* constants definitions */
typedef FlagStatus fio_status;

#define FMU_FG_EN(ID)                           BIT(ID)                                                     /*!< FMU fault groupt channel enable */

/* FMU operation status definitions */
#define FMU_OPSTAT(regval)                      (BITS(6,7) & ((uint32_t)(regval) << 6))
#define FMU_OPSTAT_IDLE                         FMU_OPSTAT(0)                                               /*!< operation status is idle */
#define FMU_OPSTAT_ONGOING                      FMU_OPSTAT(1)                                               /*!< operation status is ongoing */
#define FMU_OPSTAT_NOTSUCCESS                   FMU_OPSTAT(2)                                               /*!< operation status is not success */
#define FMU_OPSTAT_SUCCESS                      FMU_OPSTAT(3)                                               /*!< operation status is success */

/* FMU execute operation difinitions */
#define FMU_NO_OPERATION                        ((uint32_t)0x00000000U)                                     /*!< no execute operation (EOP0) */
#define FMU_TO_INIT_WORK_MODE                   ((uint32_t)0x00000001U)                                     /*!< execute operation which will transform FMU to INIT work mode (EOP1) */
#define FMU_TO_NORMAL_WORK_MODE                 ((uint32_t)0x00000002U)                                     /*!< execute operation which will transform FMU to NORMAL work mode (EOP2) */
#define FMU_FG_STAT_CLR                         ((uint32_t)0x0000000CU)                                     /*!< execute clean a FG fault flag in FMU_FGSTAT register operation is on going (EOP12) */
#define FMU_CLR_HOLD_STATUS_REGS                ((uint32_t)0x0000000DU)                                     /*!< execute operation which will clean the hold status register (EOP13) */
#define FMU_INIT_TIMEOUT_ON_GOING               ((uint32_t)0x0000000EU)                                     /*!< INIT work mode timeout is on going (EOP14) */
#define FMU_CLR_OPERATION_STATUS                ((uint32_t)0x0000000FU)                                     /*!< execute operation which will set OPSTAT[1:0] to idle (EOP15) */

/* FMU key value */
#define FMU_EOP1_KEY_U32                        ((uint32_t)0x85A670B9UL)                                    /*!< FMU key to enter INIT state */
#define FMU_EOP2_KEY_U32                        ((uint32_t)0x4C30765DUL)                                    /*!< FMU key to enter NORMAL state */
#define FMU_TEMP_LOCK_KEY_U32                   ((uint32_t)0xFFFFFF34UL)                                    /*!< FMU key to transiently lock the config registers */
#define FMU_TEMP_UNLOCK_KEY_U32                 ((uint32_t)0x000000DAUL)                                    /*!< FMU key to unlock the transiently locked config registers */
#define FMU_PERM_LOCK_KEY_U32                   ((uint32_t)0x000000FFUL)                                    /*!< FMU key to permanently lock the config registers */
#define FMU_FG_KEY_UNLOCK_U32                   ((uint32_t)0xDA3778FBUL)                                    /*!< FMU key to unlock FMU_FGSTAT registers for write access */

/* FMU status field description */
#define FMU_NORMAL_STATUS                       ((uint32_t)0x00000000U)                                     /*!< FMU the current is NORMAL state */
#define FMU_INIT_STATUS                         ((uint32_t)0x00000001U)                                     /*!< FMU the current is INIT state */
#define FMU_CAUTION_STATUS                      ((uint32_t)0x00000002U)                                     /*!< FMU the current is CAUTION state */
#define FMU_FAULT_STATUS                        ((uint32_t)0x00000003U)                                     /*!< FMU the current is FAULT state */

/* GFIO siganls work mode configuration */
#define FMU_GOMSET_MODE(regval)                 (BITS(3,5) & ((uint32_t)(regval) << 3))
#define FMU_GOMSET_FAULT_OUTPUT_MODE            FMU_GOMSET_MODE(2)                                          /*!< GFIO the protocol of the signaling is Bi-stable */
#define FMU_GOMSET_MODE_TEST0                   FMU_GOMSET_MODE(5)                                          /*!< GFIO the protocol of the signaling is test 0 */
#define FMU_GOMSET_MODE_TEST1                   FMU_GOMSET_MODE(7)                                          /*!< GFIO the protocol of the signaling is test 1 */

/* FFIO siganls work mode configuration */
#define FMU_FOMSET_MODE(regval)                 (BITS(6,8) & ((uint32_t)(regval) << 6))
#define FMU_FOMSET_MODE_BI_STABLE               FMU_FOMSET_MODE(2)                                          /*!< FFIO the protocol of the signaling is Bi-stable */
#define FMU_FOMSET_MODE_TIME_SWITCHING          FMU_FOMSET_MODE(3)                                          /*!< FFIO the protocol of the signaling is time-switching */
#define FMU_FOMSET_MODE_TEST0                   FMU_FOMSET_MODE(5)                                          /*!< FFIO the protocol of the signaling is test 0 */
#define FMU_FOMSET_MODE_TEST1                   FMU_FOMSET_MODE(6)                                          /*!< FFIO the protocol of the signaling is test 1 */
#define FMU_FOMSET_MODE_TEST2                   FMU_FOMSET_MODE(7)                                          /*!< FFIO the protocol of the signaling is test 2 */

/* FFIO siganls polarity configuration */
#define FMU_FOPCFG_HIGH0_LOW1                   FMU_CFG_FOPCFG                                              /*!< FFIO 1 is high and FFin 0 is low for the faulty infication */
#define FMU_FOPCFG_HIGH1_LOW0                   (uint32_t)(0x00000000U)                                     /*!< FFIO 1 is low and FFin 0 is high for the faulty infication */

/* GFIO siganls polarity configuration */
#define FMU_GOPS_HIGH                           FMU_CFG_GOPCFG                                              /*!< GFIO fault state output is high  */
#define FMU_GOPS_LOW                            (uint32_t)(0x00000000U)                                     /*!< GFIO fault state output is low  */

/* FFIO siganls work mode is consistent with FG fault or not */
#define FMU_FOMCFG_CONSISTENT                   FMU_CFG_FOMCFG                                              /*!< configuration indication is the same as the non-faulty indication */
#define FMU_FOMCFG_NOTCONSISTENT                (uint32_t)(0x00000000U)                                     /*!< configuration indication is the different as the non-faulty indication */

/* FFIO time switching prescaler factor */
#define FMU_FOPRE_DIV(regval)                   (BITS(16,19) & ((uint32_t)(regval) << 16))
#define FMU_FOPRE_DIV_2                         FMU_FOPRE_DIV(0)                                            /*!< FFIO and GFIO time switching prescaler is divided by 2*/
#define FMU_FOPRE_DIV_4                         FMU_FOPRE_DIV(1)                                            /*!< FFIO and GFIO time switching prescaler is divided by 4 */
#define FMU_FOPRE_DIV_8                         FMU_FOPRE_DIV(2)                                            /*!< FFIO and GFIO time switching prescaler is divided by 8 */
#define FMU_FOPRE_DIV_16                        FMU_FOPRE_DIV(3)                                            /*!< FFIO and GFIO time switching prescaler is divided by 16 */
#define FMU_FOPRE_DIV_32                        FMU_FOPRE_DIV(4)                                            /*!< FFIO and GFIO time switching prescaler is divided by 32 */
#define FMU_FOPRE_DIV_64                        FMU_FOPRE_DIV(5)                                            /*!< FFIO and GFIO time switching prescaler is divided by 64 */
#define FMU_FOPRE_DIV_128                       FMU_FOPRE_DIV(6)                                            /*!< FFIO and GFIO time switching prescaler is divided by 128 */
#define FMU_FOPRE_DIV_256                       FMU_FOPRE_DIV(7)                                            /*!< FFIO and GFIO time switching prescaler is divided by 256 */
#define FMU_FOPRE_DIV_512                       FMU_FOPRE_DIV(8)                                            /*!< FFIO and GFIO time switching prescaler is divided by 512 */
#define FMU_FOPRE_DIV_1024                      FMU_FOPRE_DIV(9)                                            /*!< FFIO and GFIO time switching prescaler is divided by 1024 */
#define FMU_FOPRE_DIV_2048                      FMU_FOPRE_DIV(10)                                           /*!< FFIO and GFIO time switching prescaler is divided by 2048 */
#define FMU_FOPRE_DIV_4096                      FMU_FOPRE_DIV(11)                                           /*!< FFIO and GFIO time switching prescaler is divided by 4096 */

/* GFIO control configuration */
#define FMU_GFIO_CONTRONL(regval)                (BITS(20,21) & ((uint32_t)(regval) << 20))
#define FMU_GFIO_CONTRONL_FSM                    FMU_GFIO_CONTRONL(0)                                       /*!< GFIO controlled by the FSM */
#define FMU_GFIO_CONTRONL_LOW                    FMU_GFIO_CONTRONL(1)                                       /*!< GFIO is always low */
#define FMU_GFIO_CONTRONL_HIGH                   FMU_GFP_CONTRONL(3)                                        /*!< GFIO is high until a fault occurs on a channel theresfter controlled by the FSM */

/* FFIO control configuration */
#define FMU_FFIO_CONTRONL(regval)                (BITS(22,23) & ((uint32_t)(regval) << 22))
#define FMU_FFIO_CONTRONL_FSM                    FMU_FFIO_CONTRONL(0)                                       /*!< FFIO controlled by the FSM */
#define FMU_FFIO_CONTRONL_LOW                    FMU_FFIO_CONTRONL(1)                                       /*!< FFIO is always low */
#define FMU_FFIO_CONTRONL_HIGH                   FMU_FFIO_CONTRONL(3)                                       /*!< FFIO is high until a fault occurs on a channel theresfter controlled by the FSM */

