sorosaulong-ux/gd32-test-project/Library/gd32a7xx_fmu.h
/* FFIO output control definitions */
#define FMU_FOS_ENABLE                          FMU_CFG_FOSEN                                               /*!< FFIO enable singal output */
#define FMU_FOS_DISABLE                        (uint32_t)(0x00000000U)                                      /*!< FFIO disable singal output */

/* GFIO output control definitions */
#define FMU_GOS_ENABLE                          FMU_CFG_GOSEN                                               /*!< GFIO enable singal output */
#define FMU_GOS_DISABLE                        (uint32_t)(0x00000000U)                                      /*!< GFIO disable singal output */

/* Fault pin definitions */
#define FMU_FFPO_0                              FMU_FPCTL_FPO0                                              /*!< FFIO 0 output */
#define FMU_FFPO_1                              FMU_FPCTL_FPO1                                              /*!< FFIO 1 output */
#define FMU_GFPO                                FMU_FPCTL_GPO                                               /*!< GFIO output */
#define FMU_FFPI_0                              FMU_FPCTL_FPI0                                              /*!< FFIO 0 input */
#define FMU_FFPI_1                              FMU_FPCTL_FPI1                                              /*!< FFIO 1 input */
#define FMU_GFPI                                FMU_FPCTL_GPI                                               /*!< GFIO input */

/* FFIO state definitions */
#define FMU_FFIO_INPUT_STAT(regval)             (BITS(4,5) & ((uint32_t)(regval) << 4))
#define FMU_FFIO_LOW0_LOW1                      FMU_FFIO_INPUT_STAT(0)                                      /*!< FFIO input state is low0, low1 */
#define FMU_FFIO_HIGH0_LOW1                     FMU_FFIO_INPUT_STAT(1)                                      /*!< FFIO input state is low0, high1 */
#define FMU_FFIO_LOW0_HIGH1                     FMU_FFIO_INPUT_STAT(2)                                      /*!< FFIO input state is high0, low1 */
#define FMU_FFIO_HIGH0_HIGH1                    FMU_FFIO_INPUT_STAT(3)                                      /*!< FFIO input state is high0, high1 */

/* fault recovery type is hardware recovery or software recovery */
#define FMU_HW_RECOVERY                         ((uint16_t)0x0000U)                                         /*!< fault recovery type is hardware recovery */
#define FMU_SW_RECOVERY                         ((uint16_t)0x0001U)                                         /*!< fault recovery type is software recovery */

/* enable or disable fault group subsystem reset */
#define FMU_SUB_RST_DISABLE                    ((uint32_t)0x0003U)                                          /*!< disable fault group subsystem reset */
#define FMU_SUB_RST_ENABLE                     ((uint32_t)0x0001U)                                          /*!< enable fault group subsystem reset */

/* enable or disable FG */
#define FMU_FG_DISABLE                          ((uint32_t)0x0000U)                                         /*!< disable FG */
#define FMU_FG_ENABLE                           ((uint32_t)0x0001U)                                         /*!< enable FG */

/* CAUTION work mode timeout is enable or disable */
#define FMU_CMT_DISABLE                         ((uint32_t)0x0000U)                                         /*!< fault group CAUTION work mode timeout is disable */
#define FMU_CMT_ENABLE                          ((uint32_t)0x0001U)                                         /*!< fault group CAUTION work mode timeout is enable */

/* CAUTION work mode interrupt request is enable or disable */
#define FMU_CMI_DISABLE                         ((uint32_t)0x0000U)                                         /*!< fault group CAUTION work mode interrupt request is disable */
#define FMU_CMI_ENABLE                          ((uint32_t)0x0001U)                                         /*!< fault group CAUTION work mode interrupt request is enable */

/* FAULT work mode non-maskable interrupt request is enable or disable */
#define FMU_NMI_DISABLE                         ((uint32_t)0x0000U)                                         /*!< fault group FAULT work mode non-maskable interrupt request is disable */
#define FMU_NMI_ENABLE                          ((uint32_t)0x0001U)                                         /*!< fault group FAULT work mode non-maskable interrupt request is enable */

/* FAULT work mode FFIO or GFIO output indication is enable or disable */
#define FMU_PINOUT_DISABLE                      ((uint32_t)0x0000U)                                         /*!< fault group FAULT work mode FFIO or GFIO output indication is disable */
#define FMU_PINOUT_ENABLE                       ((uint32_t)0x0001U)                                         /*!< fault group FAULT work mode FFIO or GFIO output indicationt is enable */

/* FAULT work mode holding timer output is enable or disable */
#define FMU_HOLD_TIMER_DISABLE                  ((uint32_t)0x0000U)                                         /*!< fault group FAULT work mode holding timer output is disable */
#define FMU_HOLD_TIMER_ENABLE                   ((uint32_t)0x0001U)                                         /*!< fault group FAULT work mode holding timer output is enable */

/* FAULT work mode holding timer output is enable or disable */
#define FMU_FAKE_FG_DISABLE                     ((uint32_t)0x0100U)                                         /*!< fake fault group injection is disable */
#define FMU_FAKE_FG_ENABLE                      ((uint32_t)0x0200U)                                         /*!< fake fault group injectiont is enable */

/* FMU irq status flag */
#define FMU_INIT_INT_PEND                       ((uint32_t)0x00000001U)                                     /*!< INIT state timeout interrupt is occuring */
#define FMU_CAUTION_INT_PEND                    ((uint32_t)0x00000002U)                                     /*!< CAUTION state timeout interrupt is occuring */
#define FMU_NMI_PEND                            ((uint32_t)0x00000004U)                                     /*!< NMI is occuring */

/* FMU CAUTION and INIT state default timeout value and minmum fault-out timer interval */
#define FMU_INIT_TIMEOUT_INIT_VALUE             ((uint32_t)(0x00000005U))                                   /*!< FMU INIT state default timeout value */
#define FMU_CAUTION_TIMEOUT_INIT_VALUE          ((uint32_t)(0x0003A980U))                                   /*!< FMU CAUTION state default timeout value */
#define FMU_FAULTOUT_TIME_INIT_VALUE            ((uint16_t)(0x0000U))                                       /*!< FMU FAULT state pin default timer interval */

/* FG states are no faults */
#define FMU_NO_FAULT                            ((uint16_t)0x0000U)                                         /*!< no faulty */

/* FUM fault source */
#define FMU_FAULT_REASON(regval)                (BITS(8,9) & ((uint32_t)(regval) << 8))
#define FMU_NO_TO_FAULT                         FMU_FAULT_REASON(0)                                         /*!< no fault */
#define FMU_FAULT_GROUP                         FMU_FAULT_REASON(2)                                         /*!< FG fault */
#define FMU_MULTIPLE_FAULT                      FMU_FAULT_REASON(3)                                         /*!< multiple faults */

