sorosaulong-ux/gd32-test-project/Library/gd32a7xx_fmu.h
/* fault group ID definitions */
#define FAULT_GROUP_ID_0                        (uint16_t)(0x0000)                                          /*!< fault group 0 */
#define FAULT_GROUP_ID_1                        (uint16_t)(0x0001)                                          /*!< fault group 1 */
#define FAULT_GROUP_ID_2                        (uint16_t)(0x0002)                                          /*!< fault group 2 */
#define FAULT_GROUP_ID_3                        (uint16_t)(0x0003)                                          /*!< fault group 3 */
#define FAULT_GROUP_ID_4                        (uint16_t)(0x0004)                                          /*!< fault group 4 */
#define FAULT_GROUP_ID_5                        (uint16_t)(0x0005)                                          /*!< fault group 5 */
#define FAULT_GROUP_ID_6                        (uint16_t)(0x0006)                                          /*!< fault group 6 */
#define FAULT_GROUP_ID_7                        (uint16_t)(0x0007)                                          /*!< fault group 7 */
#define FAULT_GROUP_ID_8                        (uint16_t)(0x0008)                                          /*!< fault group 8 */
#define FAULT_GROUP_ID_9                        (uint16_t)(0x0009)                                          /*!< fault group 9 */
#define FAULT_GROUP_ID_10                       (uint16_t)(0x000A)                                          /*!< fault group 10 */
#define FAULT_GROUP_ID_11                       (uint16_t)(0x000B)                                          /*!< fault group 11 */

/* parameter check definitions */
#ifdef FW_DEBUG_ERR_REPORT
/* check FMU FG */
#define NOT_FMU_FG(id)                          (((id) != FAULT_GROUP_ID_0)  && \
                                                 ((id) != FAULT_GROUP_ID_1)  && \
                                                 ((id) != FAULT_GROUP_ID_2)  && \
                                                 ((id) != FAULT_GROUP_ID_3)  && \
                                                 ((id) != FAULT_GROUP_ID_4)  && \
                                                 ((id) != FAULT_GROUP_ID_5)  && \
                                                 ((id) != FAULT_GROUP_ID_6)  && \
                                                 ((id) != FAULT_GROUP_ID_7)  && \
                                                 ((id) != FAULT_GROUP_ID_8)  && \
                                                 ((id) != FAULT_GROUP_ID_9)  && \
                                                 ((id) != FAULT_GROUP_ID_10) && \
                                                 ((id) != FAULT_GROUP_ID_11))

/* check FMU operation type */
#define NOT_FMU_OPTYPE(optype)                  (((optype) != FMU_TRAN_INIT_WORK_MODE)      && \
                                                 ((optype) != FMU_TRAN_NORMAL_WORK_MODE)    && \
                                                 ((optype) != FMU_CLR_HOLDING_STATUS_REGS)  && \
                                                 ((optype) != FMU_NO_EXE_OPERATION)  && \
                                                 ((optype) != FMU_CLR_OPERATION))

/* check FMU lock type */
#define NOT_FMU_LKTYPE(lktype)                  (((lktype) != FMU_LOCK_EOP1)      && \
                                                 ((lktype) != FMU_LOCK_EOP2)      && \
                                                 ((lktype) != FMU_LOCK_FG_STAT)   && \
                                                 ((lktype) != FMU_LOCK_TRANS_TEMP))

/* check FMU lock type lock */
#define NOT_FMU_LKTYPE_LK(lktype)                (((lktype) != FMU_LOCK_TRANS_TEMP)      && \
                                                 ((lktype) != FMU_LOCK_TRANS_PERM))

/* check FMU recovery type */
#define NOT_FMU_RECOVERY_TYPE(recovery_type)    (((recovery_type) != FMU_HW_RECOVERY)      && \
                                                 ((recovery_type) != FMU_SW_RECOVERY))

/* check FMU recovery type */
#define NOT_FMU_REACTION_TYPE(reaction_type)    (((reaction_type) != FMU_FRETN_CAUINT2CPU)  && \
                                                 ((reaction_type) != FMU_FRETN_SUBRST2RCU)  && \
                                                 ((reaction_type) != FMU_FRETN_NMI2CPU)     && \
                                                 ((reaction_type) != FMU_FRETN_FFIO)        && \
                                                 ((reaction_type) != FMU_FRETN_GFIO)        && \
                                                 ((reaction_type) != FMU_FRETN_GPO))

/* check control status */
#define NOT_FMU_CONTROL_STATUS(new_value)        (((new_value) != ENABLE) && \
                                                 ((new_value) != DISABLE))

/* check FMU timer type */
#define NOT_FMU_TIMTYPE(tim_type)               (((tim_type) != FMU_CAUTION_TIMEROUT) && \
                                                 ((tim_type) != FMU_INIT_TIMEROUT) && \
                                                 ((tim_type) != FMU_FAULT_OUTPUT_TIMER))

/* check the length of FMU timer value */
#define FMU_TIMER_IMT_HIGH_VALUE                ((uint32_t)0x00000007U)         /*!< maximum FMU INIT work mode timeout value */
#define FMU_TIMER_FOT_HIGH_VALUE                ((uint32_t)0x00003FFFU)         /*!< maximum FMU FOT timer value */
#define NOT_FMU_TIMER_IMT_LENGTH(tim_value)     ((FMU_TIMER_IMT_HIGH_VALUE < (tim_value)))
#define NOT_FMU_TIMER_FOT_LENGTH(tim_value)     ((FMU_TIMER_FOT_HIGH_VALUE < (tim_value)))

/* check FMU FIO */
#define NOT_FMU_FO(fio)                         (((fio) != FMU_FFPO_0) && \
                                                 ((fio) != FMU_FFPO_1) && \
                                                 ((fio) != FMU_GFPO))

#define NOT_FMU_FI(fio)                         (((fio) != FMU_FFPI_0) && \
                                                 ((fio) != FMU_FFPI_1) && \
                                                 ((fio) != FMU_GFPI))

/* check FIO status */
#define NOT_FIO_STATUS(new_value)               (((new_value) != RESET) && \
                                                 ((new_value) != SET))

/* check the range of FMU fake FG */
#define FMU_FAKE_FG_HIGH_VALUE                  ((uint8_t)0x9FU)                /*!< maximum FMU fake FG  */
#define NOT_FMU_FAKE_FG_VALUE(value)            ((FMU_FAKE_FG_HIGH_VALUE < (value)))

/* check FMU work mode transition type */
#define NOT_FMU_TRANS_TYPE(type)                (((type) != FMU_TRANS_N2C)  && \
                                                 ((type) != FMU_TRANS_C2F) && \
                                                 ((type) != FMU_TRANS_N2F) && \
                                                 ((type) != FMU_TRANS_F2C))

