sorosaulong-ux/gd32-test-project/Library/gd32a7xx_fmu.h
/* check FMU interrupt type */
#define NOT_FMU_INT_TYPE(type)                  (((type) != FMU_INT_INIT)     && \
                                                 ((type) != FMU_INT_CAUTION) && \
                                                 ((type) != FMU_INT_NMI))

#define NOT_FMU_INT_TYPE_CLEAR(type)            (((type) != FMU_INT_INIT))

/* check FMU counter type */
#define NOT_FMU_CNT_TYPE(type)                  (((type) != FMU_CAUTION_WORK_MODE_CNT)     && \
                                                 ((type) != FMU_INIT_WORK_MODE_CNT)       && \
                                                 ((type) != FMU_FF_OUTPUT_CNT)            && \
                                                 ((type) != FMU_GF_OUTPUT_CNT))

/* check the range of FMU software triggered fault */
#define FMU_SOFT_TRI_LOW_VALUE                  ((uint8_t)0x88U)                /*!< minimum FMU software triggered fault */
#define NOT_FMU_SOFT_TRI_VALUE(value)           ((FMU_SOFT_TRI_LOW_VALUE > (value)) || (FMU_FAKE_FG_HIGH_VALUE < (value)))

/* check FMU counter type */
#define NOT_FMU_TMR_ERR_TYPE(type)              (((type) != FMU_TME0_DBGEN)                && \
                                                 ((type) != FMU_TME1_FOS_GOS_ENCFG)       && \
                                                 ((type) != FMU_TME2_FG_ENCFG))

#endif /* FW_DEBUG_ERR_REPORT */

/* function declarations */
/* FMU fault IO configuration and read functions*/
/* initialize the struct parameters of FMU FIO */
void fmu_fio_para_init(fmu_fio_parameter_struct* fmu_fio_struct);
/* configure FMU FIO */
void fmu_fio_config(fmu_fio_parameter_struct* fmu_fio_struct);

/* initialize the parameters of FMU structure with the default values */
void fmu_para_init(fmu_parameter_struct* fmu_struct);
/* configure FMU parameter */
void fmu_config(fmu_parameter_struct* fmu_struct, uint16_t fault_group_id);
/* execute FMU operation */
void fmu_operation_execute(fmu_operation_enum operation_type);
/* FMU read current operation status */
fmu_operation_status_enum fmu_operation_status_read(void);

/* unlock FMU */
void fmu_unlock(fmu_lock_type_enum lock_type);
/* lock FMU */
void fmu_lock(fmu_lock_type_enum lock_type);
/* configure FMU recovery type */
void fmu_fg_recovery_type_config(uint16_t recovery_type, uint16_t fault_group_id);
/* configure FMU fault reaction */
void fmu_fault_reaction_config(fmu_fretn_type_enum reaction_type, uint16_t fault_group_id, ControlStatus new_value);


/* configure FMU timer */
void fmu_timer_config(fmu_tim_type_enum tim_type, uint32_t tim_value);
/* configure FMU FIO */
void fmu_fio_output_config(uint32_t fault_pin, fio_status output_value);
/* get FMU fault IO signal input status */
fio_status fmu_fio_input_get(uint32_t fault_pin);
/* read FMU FFIO signal control status */
fmu_ffio_status_enum fmu_ffio_status_read(void);
/* read FMU GFpin signal control status */
fio_status fmu_gfio_status_read(void);
/* get FMU status */
fmu_faulty_status_enum fmu_status_get(void);
/* read FMU current work mode */
fmu_status_enum fmu_workmode_read(void);
/* injection FMU fake FG fault */
void fmu_ff_injection(uint32_t fault_group_id);
/* read FMU transition FG */
uint32_t fmu_trans_fg_read(fmu_trans_type_enum trans_type);
/* read FMU counter */
uint32_t fmu_counter_read(fmu_cnt_type_enum cnt_type);

/* configure FMU TMR error output */
void fmu_tmr_error_output_config(fmu_tmr_error_type_enum tmr_error_type, ControlStatus new_value);

/* flag get and clear */
/* get FMU fault flag */
uint32_t fmu_fault_flag_get(void);
/* clear FMU FG status */
void fmu_fg_status_clear(uint16_t fault_group_id);
/* get FMU group fault status */
FlagStatus fmu_fg_status_get(uint16_t fault_group_id);
/* get FMU FG trigger source status */
FlagStatus fmu_fg_trigger_source_status_get(uint8_t trigger_source_num);
/* clear FMU FG trigger source status */
void fmu_fg_trigger_source_status_clear(uint8_t trigger_source_num);
/* get FMU TMR error output status */
FlagStatus fmu_tmr_error_status_get(fmu_tmr_error_type_enum tmr_error_type);
/* clear FMU TMR error output status */
void fmu_tmr_error_status_clear(fmu_tmr_error_type_enum tmr_error_type);

/* enable FMU debug mode */
void fmu_dbg_enable(void);
/* disable FMU debug mode */
void fmu_dbg_disable(void);
/* enabled FMU FG */
void fmu_fg_enable(uint16_t fault_group_id);
/* disabled FMU FG */
void fmu_fg_disable(uint16_t fault_group_id);
/* enable FMU CAUTION timeout */
void fmu_caution_timeout_enable(uint16_t fault_group_id);
/* disable FMU CAUTION timeout */
void fmu_caution_timeout_disable(uint16_t fault_group_id);
/* enable injection FMU fake FG */
void fmu_ff_inject_enable(void);
/* disable injection FMU fake FG */
void fmu_ff_inject_disable(void);
/* enable FMU FG trigger source */
void fmu_fg_trigger_source_enable(uint8_t trigger_source_num);
/* disable FMU FG trigger source */
void fmu_fg_trigger_source_disable(uint8_t trigger_source_num);
/* enable FMU software triggered fault */
void fmu_fg_soft_trig_fault_enable(uint8_t soft_trig_fault_num);
/* disable FMU software triggered fault */
void fmu_fg_soft_trig_fault_disable(uint8_t soft_trig_fault_num);
/* enable FMU INIT status timeout interrupt */
void fmu_init_timeout_irq_enable(void);
/* disable FMU INIT status timeout interrupt */
void fmu_init_timeout_irq_disable(void);

/* get FMU current interrupt status */
FlagStatus fmu_interrupt_flag_get(fmu_int_type_enum int_type);
/* clear FMU interrupt flag */
void fmu_interrupt_flag_clear(fmu_int_type_enum int_type);

#endif /* GD32A7XX_FMU_H */
